# SQL BASICS

In [1]:
%load_ext sql
%sql sqlite:///students.db

## Creating Tables and Inserting Data

#### DROP, CREATE, INSERT INTO, UPDATE AND SET, DELETE FROM

In [10]:
%%sql

DROP TABLE IF EXISTS students;

CREATE TABLE students (
id INTEGER PRIMARY KEY,
name TEXT,
age INT,
grade REAL
)

 * sqlite:///students.db
Done.
Done.

[]

In [11]:
%%sql

INSERT INTO students (name, age, grade) VALUES
('Ali', 17, 18.5),
('Sara', 18, 19.2),
('Nima', 16, 17.4),
('Mahsa', 19, 13.0),
('Mohammad', 18, 15.5),
('Elham', 17, 19.7),
('Behzad', 20, 14.0),
('Tara', 18, 20.0)

 * sqlite:///students.db
8 rows affected.

[]

In [ ]:
%%sql
UPDATE students SET grade = 19.0 WHERE name = 'Ali';

In [ ]:
%sql
DELETE FROM students WHERE age < 16;

## Querying Data

#### SELECT, FROM, WHERE, ORDER BY, GROUP BY, HAVING, +(COUNT, AVG, MAX, MIN)

In [12]:
%%sql
SELECT *
FROM students

 * sqlite:///students.db
Done.

[(1, 'Ali', 17, 18.5),
 (2, 'Sara', 18, 19.2),
 (3, 'Nima', 16, 17.4),
 (4, 'Mahsa', 19, 13.0),
 (5, 'Mohammad', 18, 15.5),
 (6, 'Elham', 17, 19.7),
 (7, 'Behzad', 20, 14.0),
 (8, 'Tara', 18, 20.0)]

In [13]:
%%sql

SELECT name, grade
FROM students
WHERE grade>17 and age<19
ORDER BY grade desc

 * sqlite:///students.db
Done.

[('Tara', 20.0),
 ('Elham', 19.7),
 ('Sara', 19.2),
 ('Ali', 18.5),
 ('Nima', 17.4)]

In [25]:
%%sql

SELECT age, AVG(grade) as average_grade
FROM students
GROUP BY age
ORDER BY average_grade desc

 * sqlite:///students.db
Done.

[(17, 19.1), (18, 18.233333333333334), (16, 17.4), (20, 14.0), (19, 13.0)]

In [26]:
%%sql

SELECT age, AVG(grade) as average_grade
FROM students
GROUP BY age
HAVING average_grade > 15
ORDER BY average_grade desc

 * sqlite:///students.db
Done.

[(17, 19.1), (18, 18.233333333333334), (16, 17.4)]

In [29]:
%%sql

SELECT name, age, MAX(grade) as max_grade_in_age
FROM students
GROUP BY age
HAVING COUNT(age)>=2

 * sqlite:///students.db
Done.

[('Elham', 17, 19.7), ('Tara', 18, 20.0)]

In [30]:
%%sql

SELECT age, COUNT(age) as count_age
FROM students

 * sqlite:///students.db
Done.

[(17, 8)]

## JOIN

#### Creating second table

In [31]:
%%sql

DROP TABLE IF EXISTS courses;

CREATE TABLE courses (
course_id INTEGER PRIMARY KEY,
    student_id INTEGER,
    course_name TEXT,
    FOREIGN KEY (student_id) REFERENCES students(id)
)

 * sqlite:///students.db
Done.
Done.

[]

In [34]:
%%sql

INSERT INTO courses (student_id, course_name) VALUES
(1, 'Math'),
(1, 'Physics'),
(2, 'Math'),
(4, 'Chemistry'),
(5, 'Biology'),
(6, 'Math'),
(6, 'Biology'),
(8, 'Physics')

 * sqlite:///students.db
8 rows affected.

[]

In [39]:
%%sql

SELECT *
FROM courses;

 * sqlite:///students.db
Done.

[(1, 1, 'Math'),
 (2, 1, 'Physics'),
 (3, 2, 'Math'),
 (4, 4, 'Chemistry'),
 (5, 5, 'Biology'),
 (6, 6, 'Math'),
 (7, 6, 'Biology'),
 (8, 8, 'Physics')]

In [38]:
%%sql

SELECT *
FROM students;

 * sqlite:///students.db
Done.

[(1, 'Ali', 17, 18.5),
 (2, 'Sara', 18, 19.2),
 (3, 'Nima', 16, 17.4),
 (4, 'Mahsa', 19, 13.0),
 (5, 'Mohammad', 18, 15.5),
 (6, 'Elham', 17, 19.7),
 (7, 'Behzad', 20, 14.0),
 (8, 'Tara', 18, 20.0)]

In [40]:
%%sql

SELECT s.name, c.course_name
FROM students s
INNER JOIN courses c
ON s.id = c.student_id

 * sqlite:///students.db
Done.

[('Ali', 'Math'),
 ('Ali', 'Physics'),
 ('Sara', 'Math'),
 ('Mahsa', 'Chemistry'),
 ('Mohammad', 'Biology'),
 ('Elham', 'Math'),
 ('Elham', 'Biology'),
 ('Tara', 'Physics')]

In [43]:
%%sql

SELECT s.id, s.name, c.course_name
FROM students s
LEFT JOIN courses c
ON s.id = c.student_id
ORDER BY s.name

 * sqlite:///students.db
Done.

[(1, 'Ali', 'Math'),
 (1, 'Ali', 'Physics'),
 (7, 'Behzad', None),
 (6, 'Elham', 'Biology'),
 (6, 'Elham', 'Math'),
 (4, 'Mahsa', 'Chemistry'),
 (5, 'Mohammad', 'Biology'),
 (3, 'Nima', None),
 (2, 'Sara', 'Math'),
 (8, 'Tara', 'Physics')]

In [50]:
%%sql

SELECT s.id, s.name
FROM students s
LEFT JOIN courses c
ON s.id = c.student_id
WHERE c.course_name IS NULL

 * sqlite:///students.db
Done.

[(3, 'Nima'), (7, 'Behzad')]

In [60]:
%%sql

SELECT s.id, s.name, COUNT(*) as course_count
FROM students s
JOIN courses c
ON s.id = c.student_id
GROUP BY s.name

 * sqlite:///students.db
Done.

[(1, 'Ali', 2),
 (6, 'Elham', 2),
 (4, 'Mahsa', 1),
 (5, 'Mohammad', 1),
 (2, 'Sara', 1),
 (8, 'Tara', 1)]

In [62]:
%%sql

SELECT c.course_name, COUNT(*) as student_count
FROM students s
JOIN courses c
ON s.id = c.student_id
GROUP BY c.course_name

 * sqlite:///students.db
Done.

[('Biology', 2), ('Chemistry', 1), ('Math', 3), ('Physics', 2)]

In [64]:
%%sql

SELECT s.id, s.name, COUNT(*) as course_count
FROM students s
JOIN courses c
ON s.id = c.student_id
GROUP BY s.name
HAVING course_count>1

 * sqlite:///students.db
Done.

[(1, 'Ali', 2), (6, 'Elham', 2)]

## SubQueries

In [122]:
%%sql

SELECT s.id, s.age, AVG(s.grade) as average_grade, COUNT(c.course_name) as course_count
FROM students s
JOIN courses c ON s.id = c.student_id
GROUP BY s.id, s.age
HAVING course_count > 1

 * sqlite:///students.db
Done.

[(1, 17, 18.5, 2), (6, 17, 19.7, 2)]

In [123]:
%%sql

SELECT age, AVG(average_student_grade) as average_age_grade
FROM(
SELECT s.id, s.age, AVG(s.grade) as average_student_grade, COUNT(c.course_name) as course_count
FROM students s
JOIN courses c ON s.id = c.student_id
GROUP BY s.id, s.age
HAVING course_count > 1) AS subquery
GROUP BY age
ORDER BY average_age_grade DESC

 * sqlite:///students.db
Done.

[(17, 19.1)]

In [84]:
%%sql

SELECT c.course_name, COUNT(*) as student_count
FROM students s
JOIN courses c ON s.id = c.student_id
GROUP BY c.course_name
HAVING student_count = 1

 * sqlite:///students.db
Done.

[('Chemistry', 1)]

In [97]:
%%sql

SELECT name, course_count, grade
FROM(
    SELECT s.id, s.name, COUNT(*) AS course_count, s.grade
    FROM students s
    JOIN courses c ON s.id = c.student_id
    GROUP BY s.name
) AS subquery
WHERE course_count>=2 and grade>15

 * sqlite:///students.db
Done.

[('Ali', 2, 18.5), ('Elham', 2, 19.7)]

## CASE

In [99]:
%%sql
SELECT 
  name,
  age,
  CASE 
    WHEN age < 18 THEN 'Underage'
    WHEN age BETWEEN 18 AND 22 THEN 'Student Age'
    ELSE 'Adult'
  END AS age_group
FROM students;

 * sqlite:///students.db
Done.

[('Ali', 17, 'Underage'),
 ('Sara', 18, 'Student Age'),
 ('Nima', 16, 'Underage'),
 ('Mahsa', 19, 'Student Age'),
 ('Mohammad', 18, 'Student Age'),
 ('Elham', 17, 'Underage'),
 ('Behzad', 20, 'Student Age'),
 ('Tara', 18, 'Student Age')]

In [100]:
%%sql

SELECT
name,
CASE
    WHEN age<18 THEN 'Teen'
    WHEN age BETWEEN 18 AND 20 THEN 'Young Adult'
    ELSE 'Adult'
END AS age_group
FROM students

 * sqlite:///students.db
Done.

[('Ali', 'Teen'),
 ('Sara', 'Young Adult'),
 ('Nima', 'Teen'),
 ('Mahsa', 'Young Adult'),
 ('Mohammad', 'Young Adult'),
 ('Elham', 'Teen'),
 ('Behzad', 'Young Adult'),
 ('Tara', 'Young Adult')]

In [102]:
%%sql
SELECT
name,
CASE
    WHEN grade>18 THEN 'Excellent'
    WHEN grade BETWEEN 15 AND 18 THEN 'Good'
    ELSE 'Needs Improvement'
END AS status
From students

 * sqlite:///students.db
Done.

[('Ali', 'Excellent'),
 ('Sara', 'Excellent'),
 ('Nima', 'Good'),
 ('Mahsa', 'Needs Improvement'),
 ('Mohammad', 'Good'),
 ('Elham', 'Excellent'),
 ('Behzad', 'Needs Improvement'),
 ('Tara', 'Excellent')]

## WITH    AS

In [109]:
%%sql

WITH course_counts AS(
    SELECT s.id, s.name, COUNT(*) AS course_count
    FROM students s
    JOIN courses c ON s.id = c.student_id
    GROUP BY s.id, s.name
)
SELECT *
FROM course_counts
WHERE course_count > 1;

 * sqlite:///students.db
Done.

[(1, 'Ali', 2), (6, 'Elham', 2)]

In [113]:
%%sql
WITH course_counts AS (
    SELECT s.id, s.name, COUNT(*) AS course_count
    FROM students s
    JOIN courses c ON s.id = c.student_id
    GROUP BY s.id, s.name
)
SELECT name, course_count
FROM course_counts
WHERE course_count >=2

 * sqlite:///students.db
Done.

[('Ali', 2), ('Elham', 2)]

#### Creating Third Table

In [114]:
%%sql

DROP TABLE IF EXISTS enrollments;

CREATE TABLE enrollments (
    student_id INTEGER,
    course_id INTEGER,
    grade REAL,
    FOREIGN KEY (student_id) REFERENCES students(id),
    FOREIGN KEY (course_id) REFERENCES courses(id)
);

INSERT INTO enrollments (student_id, course_id, grade) VALUES
(1, 1, 18.5), -- Ali - mathematics
(1, 2, 17.0), -- Ali - biology
(6, 1, 19.0), -- Elham - mathematics
(6, 2, 18.0), -- Elham - biology
(4, 3, 13.0), -- Mahsa - geography
(5, 2, 15.5), -- Mohammad - biology
(2, 1, 19.2), -- Sara - mathematics
(8, 2, 20.0); -- Tara - biology

 * sqlite:///students.db
Done.
Done.
8 rows affected.

[]

In [115]:
%%sql

SELECT *
FROM enrollments

 * sqlite:///students.db
Done.

[(1, 1, 18.5),
 (1, 2, 17.0),
 (6, 1, 19.0),
 (6, 2, 18.0),
 (4, 3, 13.0),
 (5, 2, 15.5),
 (2, 1, 19.2),
 (8, 2, 20.0)]

In [118]:
%%sql

WITH avg_grade AS(
SELECT s.name, AVG(e.grade) as avg_gr
FROM students s
JOIN enrollments e ON s.id = e.student_id
GROUP BY s.id, s.name
) 
SELECT name, avg_gr
FROM avg_grade
WHERE avg_gr>17

 * sqlite:///students.db
Done.

[('Ali', 17.75), ('Sara', 19.2), ('Elham', 18.5), ('Tara', 20.0)]

## 🟢 Conclusion

This notebook covered fundamental SQL operations including data definition (DDL), data manipulation (DML), querying, filtering, sorting, grouping, aggregation, joins, and subqueries using a sample SQLite database.  
Each section was designed to provide hands-on practice and reinforce essential SQL concepts.  
This practice has helped solidify my understanding of SQL syntax and logic, preparing me for real-world data analysis tasks and future projects involving more complex databases and queries.

---

## 📚 References

- [SQLite Documentation](https://www.sqlite.org/docs.html) – Official documentation for SQLite syntax and features  
- [W3Schools SQL Tutorial](https://www.w3schools.com/sql/) – Basic SQL tutorials and examples  
- [Mode Analytics SQL Tutorial](https://mode.com/sql-tutorial/) – Practical SQL for data analysts  
- Personal notes and exercises from hands-on practice sessions